traffic/MDMImporter/yes42.xml

<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><d2LogicalModel xmlns="http://datex2.eu/schema/2/2_0" modelBaseVersion="2" extensionName="MDM" extensionVersion="00-01-03" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://datex2.eu/schema/2/2_0 http://bast.s3.amazonaws.com/schema/1385369839450/MDM-Profile_ParkingFacilityStatus.xsd"><exchange><supplierIdentification><country>de</country><nationalIdentifier>DE-MDM-Kassel</nationalIdentifier></supplierIdentification></exchange><payloadPublication xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="GenericPublication" lang="de"><publicationTime>2018-07-09T13:49:27.604+02:00</publicationTime><publicationCreator><country>de</country><nationalIdentifier>DE-MDM-Kassel</nationalIdentifier></publicationCreator><genericPublicationName>ParkingFacilityTableStatusPublication</genericPublicationName><genericPublicationExtension><parkingFacilityTableStatusPublication><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><parkingAreaStatus><parkingAreaOccupancy>0.69964457</parkingAreaOccupancy><parkingAreaReference targetClass="ParkingArea" id="1001[Stadtmitte]" version="1.0"/><parkingAreaStatusTime>2018-07-09T13:49:00.834+02:00</parkingAreaStatusTime><parkingAreaTotalNumberOfVacantParkingSpaces>1014</parkingAreaTotalNumberOfVacantParkingSpaces><totalParkingCapacityLongTermOverride>3376</totalParkingCapacityLongTermOverride><totalParkingCapacityShortTermOverride>3376</totalParkingCapacityShortTermOverride></parkingAreaStatus><parkingAreaStatus><parkingAreaOccupancy>0.45333335</parkingAreaOccupancy><parkingAreaReference targetClass="ParkingArea" id="1002[Bhf. Wilhelmshöhe]" version="1.0"/><parkingAreaStatusTime>2018-07-09T13:49:00.834+02:00</parkingAreaStatusTime><parkingAreaTotalNumberOfVacantParkingSpaces>82</parkingAreaTotalNumberOfVacantParkingSpaces><totalParkingCapacityLongTermOverride>150</totalParkingCapacityLongTermOverride><totalParkingCapacityShortTermOverride>150</totalParkingCapacityShortTermOverride></parkingAreaStatus><parkingFacilityStatus><parkingFacilityOccupancy>0.7772727</parkingFacilityOccupancy><parkingFacilityReference targetClass="ParkingFacility" id="7[City Point]" version="1.0"/><parkingFacilityStatus>open</parkingFacilityStatus><parkingFacilityStatusTime>2018-07-09T13:49:00.834+02:00</parkingFacilityStatusTime><totalNumberOfOccupiedParkingSpaces>171</totalNumberOfOccupiedParkingSpaces><totalNumberOfVacantParkingSpaces>49</totalNumberOfVacantParkingSpaces><totalParkingCapacityOverride>220</totalParkingCapacityOverride><totalParkingCapacityShortTermOverride>220</totalParkingCapacityShortTermOverride></parkingFacilityStatus><parkingFacilityStatus><parkingFacilityOccupancy>1.0</parkingFacilityOccupancy><parkingFacilityReference targetClass="ParkingFacility" id="6[Theaterplatz]" version="1.0"/><parkingFacilityStatus>statusUnknown</parkingFacilityStatus><parkingFacilityStatusTime>2018-07-09T13:49:00.834+02:00</parkingFacilityStatusTime><totalNumberOfOccupiedParkingSpaces>228</totalNumberOfOccupiedParkingSpaces><totalNumberOfVacantParkingSpaces>0</totalNumberOfVacantParkingSpaces><totalParkingCapacityOverride>228</totalParkingCapacityOverride><totalParkingCapacityShortTermOverride>228</totalParkingCapacityShortTermOverride></parkingFacilityStatus><parkingFacilityStatus><parkingFacilityOccupancy>0.7734694</parkingFacilityOccupancy><parkingFacilityReference targetClass="ParkingFacility" id="1[Friedrichsplatz]" version="1.0"/><parkingFacilityStatus>open</parkingFacilityStatus><parkingFacilityStatusTime>2018-07-09T13:49:00.834+02:00</parkingFacilityStatusTime><totalNumberOfOccupiedParkingSpaces>758</totalNumberOfOccupiedParkingSpaces><totalNumberOfVacantParkingSpaces>222</totalNumberOfVacantParkingSpaces><totalParkingCapacityOverride>980</totalParkingCapacityOverride><totalParkingCapacityShortTermOverride>980</totalParkingCapacityShortTermOverride></parkingFacilityStatus><parkingFacilityStatus><parkingFacilityOccupancy>0.3167702</parkingFacilityOccupancy><parkingFacilityReference targetClass="ParkingFacility" id="4[Wilhelmsstraße]" version="1.0"/><parkingFacilityStatus>open</parkingFacilityStatus><parkingFacilityStatusTime>2018-07-09T13:49:00.834+02:00</parkingFacilityStatusTime><totalNumberOfOccupiedParkingSpaces>102</totalNumberOfOccupiedParkingSpaces><totalNumberOfVacantParkingSpaces>220</totalNumberOfVacantParkingSpaces><totalParkingCapacityOverride>322</totalParkingCapacityOverride><totalParkingCapacityShortTermOverride>322</totalParkingCapacityShortTermOverride></parkingFacilityStatus><parkingFacilityStatus><parkingFacilityOccupancy>0.5451613</parkingFacilityOccupancy><parkingFacilityReference targetClass="ParkingFacility" id="2[Kurfürsten Galerie]" version="1.0"/><parkingFacilityStatus>open</parkingFacilityStatus><parkingFacilityStatusTime>2018-07-09T13:49:00.834+02:00</parkingFacilityStatusTime><totalNumberOfOccupiedParkingSpaces>338</totalNumberOfOccupiedParkingSpaces><totalNumberOfVacantParkingSpaces>282</totalNumberOfVacantParkingSpaces><totalParkingCapacityOverride>620</totalParkingCapacityOverride><totalParkingCapacityShortTermOverride>620</totalParkingCapacityShortTermOverride></parkingFacilityStatus><parkingFacilityStatus><parkingFacilityOccupancy>1.0</parkingFacilityOccupancy><parkingFacilityReference targetClass="ParkingFacility" id="5[Rathaus]" version="1.0"/><parkingFacilityStatus>closed</parkingFacilityStatus><parkingFacilityStatusTime>2018-07-09T13:49:00.834+02:00</parkingFacilityStatusTime><totalNumberOfOccupiedParkingSpaces>298</totalNumberOfOccupiedParkingSpaces><totalNumberOfVacantParkingSpaces>0</totalNumberOfVacantParkingSpaces><totalParkingCapacityOverride>298</totalParkingCapacityOverride><totalParkingCapacityShortTermOverride>298</totalParkingCapacityShortTermOverride></parkingFacilityStatus><parkingFacilityStatus><parkingFacilityOccupancy>0.48510638</parkingFacilityOccupancy><parkingFacilityReference targetClass="ParkingFacility" id="10[Galeria Kaufhof]" version="1.0"/><parkingFacilityStatus>open</parkingFacilityStatus><parkingFacilityStatusTime>2018-07-09T13:49:00.834+02:00</parkingFacilityStatusTime><totalNumberOfOccupiedParkingSpaces>114</totalNumberOfOccupiedParkingSpaces><totalNumberOfVacantParkingSpaces>121</totalNumberOfVacantParkingSpaces><totalParkingCapacityOverride>235</totalParkingCapacityOverride><totalParkingCapacityShortTermOverride>235</totalParkingCapacityShortTermOverride></parkingFacilityStatus><parkingFacilityStatus><parkingFacilityOccupancy>0.20353982</parkingFacilityOccupancy><parkingFacilityReference targetClass="ParkingFacility" id="9[Martinskirche]" version="1.0"/><parkingFacilityStatus>open</parkingFacilityStatus><parkingFacilityStatusTime>2018-07-09T13:49:00.834+02:00</parkingFacilityStatusTime><totalNumberOfOccupiedParkingSpaces>23</totalNumberOfOccupiedParkingSpaces><totalNumberOfVacantParkingSpaces>90</totalNumberOfVacantParkingSpaces><totalParkingCapacityOverride>113</totalParkingCapacityOverride><totalParkingCapacityShortTermOverride>113</totalParkingCapacityShortTermOverride></parkingFacilityStatus><parkingFacilityStatus><parkingFacilityOccupancy>0.9166667</parkingFacilityOccupancy><parkingFacilityReference targetClass="ParkingFacility" id="3[Garde-du-Corps]" version="1.0"/><parkingFacilityStatus>open</parkingFacilityStatus><parkingFacilityStatusTime>2018-07-09T13:49:00.834+02:00</parkingFacilityStatusTime><totalNumberOfOccupiedParkingSpaces>330</totalNumberOfOccupiedParkingSpaces><totalNumberOfVacantParkingSpaces>30</totalNumberOfVacantParkingSpaces><totalParkingCapacityOverride>360</totalParkingCapacityOverride><totalParkingCapacityShortTermOverride>360</totalParkingCapacityShortTermOverride></parkingFacilityStatus><parkingFacilityStatus><parkingFacilityOccupancy>0.45333335</parkingFacilityOccupancy><parkingFacilityReference targetClass="ParkingFacility" id="8[Atrium]" version="1.0"/><parkingFacilityStatus>open</parkingFacilityStatus><parkingFacilityStatusTime>2018-07-09T13:49:00.834+02:00</parkingFacilityStatusTime><totalNumberOfOccupiedParkingSpaces>68</totalNumberOfOccupiedParkingSpaces><totalNumberOfVacantParkingSpaces>82</totalNumberOfVacantParkingSpaces><totalParkingCapacityOverride>150</totalParkingCapacityOverride><totalParkingCapacityShortTermOverride>150</totalParkingCapacityShortTermOverride></parkingFacilityStatus></parkingFacilityTableStatusPublication></genericPublicationExtension></payloadPublication></d2LogicalModel></S:Body></S:Envelope>